# a = int(input("Введите длину 1 стороны: "))
# b = int(input("Введите длину 2 стороны: "))
# c = int(input("Введите длину 3 стороны: "))

# if (a + b > c) and (a + c > b) and (b + c > a):
#     print("Треугольник существует")
# else:
#     print("Треугольник не существует")

# if (a==b==c):
#     print("Треугольник равносторонний")
# elif (a==b or b==c or a==c):
#     print("Треугольник равнобедренный")
# else:
#     print("Треугольник разносторонний")





# a = int(input("Введите число: "))

# if (a < 0 ) or (a > 100000):
#     print("Неправильно выбрано число")
#     exit()   
# if (a == 1 or a == 0):
#     print ('Не является ни простым ни составным')
#     exit()
       
# for j in range (2, int(a**0.5) + 1):
#     if a % j == 0:
#         print ('Число составное')
#         break
# else:
#     print ('Число простое')
       
